src_ext/InformationRegisters/УЗ_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЦеныТарифов/Ext/ManagerModule.bsl
Функция ПолучитьСуммуТарифаНаДату(Тариф, Дата) Экспорт
	
	ДанныеС = новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныТарифовСрезПоследних.Сумма КАК Сумма,
		|	ЦеныТарифовСрезПоследних.КоличествоЧасов КАК КоличествоЧасов,
		|	ЦеныТарифовСрезПоследних.КоличествоУроков КАК КоличествоУроков,
		|	ЦеныТарифовСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.УЗ_ЦеныТарифов.СрезПоследних(&Период, Тариф = &Тариф) КАК ЦеныТарифовСрезПоследних";  	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Тариф", Тариф);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 1 Тогда
		
		Если РезультатЗапроса[0].КоличествоУроков = 0 и РезультатЗапроса[0].КоличествоЧасов = 0 Тогда
			ДанныеС.Вставить("КоличествоУроков",1);
		Иначе
			ДанныеС.Вставить("КоличествоУроков",РезультатЗапроса[0].КоличествоУроков);
		КонецЕсли;
		
		ДанныеС.Вставить("КоличествоЧасов",РезультатЗапроса[0].КоличествоЧасов);
		ДанныеС.Вставить("Сумма",РезультатЗапроса[0].Сумма);
		
		Возврат ДанныеС;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции
